#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/maxfrise/maxfrise-infra/runs/run-mT6sdFu79nonAhRx

Waiting for the plan to start...

Terraform v1.4.2
on linux_amd64
Initializing plugins and modules...
module.sample_lambda.null_resource.build_lambda_function: Refreshing state... [id=1986226885634115938]
module.sample_lambda.aws_iam_role.iam_for_lambda: Refreshing state... [id=iam_for_lambda]
module.sayHi_bucket.aws_s3_bucket.lambda_bucket: Refreshing state... [id=testing-submodules-resources]
module.sample_lambda.aws_lambda_function.hello-terraform: Refreshing state... [id=hello-terraform]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.s3_bucket.aws_s3_bucket.lambda_bucket will be created
  + resource "aws_s3_bucket" "lambda_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "testing-submodules-resources"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "dev"
          + "MaxfriseAPI" = "true"
          + "Terraform"   = "true"
        }
      + tags_all                    = {
          + "Environment" = "dev"
          + "MaxfriseAPI" = "true"
          + "Terraform"   = "true"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # module.sample_lambda.null_resource.build_lambda_function must be replaced
-/+ resource "null_resource" "build_lambda_function" {
      ~ id       = "1986226885634115938" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "build_number" = "2023-06-11T07:11:36Z" -> (known after apply)
        }
    }

  # module.sayHi_bucket.aws_s3_bucket.lambda_bucket will be destroyed
  # (because aws_s3_bucket.lambda_bucket is not in configuration)
  - resource "aws_s3_bucket" "lambda_bucket" {
      - arn                         = "arn:aws:s3:::testing-submodules-resources" -> null
      - bucket                      = "testing-submodules-resources" -> null
      - bucket_domain_name          = "testing-submodules-resources.s3.amazonaws.com" -> null
      - bucket_regional_domain_name = "testing-submodules-resources.s3.us-west-2.amazonaws.com" -> null
      - force_destroy               = false -> null
      - hosted_zone_id              = "Z3BJ6K6RIION7M" -> null
      - id                          = "testing-submodules-resources" -> null
      - object_lock_enabled         = false -> null
      - region                      = "us-west-2" -> null
      - request_payer               = "BucketOwner" -> null
      - tags                        = {
          - "Environment" = "dev"
          - "MaxfriseAPI" = "true"
          - "Terraform"   = "true"
        } -> null
      - tags_all                    = {
          - "Environment" = "dev"
          - "MaxfriseAPI" = "true"
          - "Terraform"   = "true"
        } -> null

      - grant {
          - id          = "b637815b98f7c2d6d854fa5cf8347724878bc4982ec6a23d6dfb9d99a5475152" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
        }

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "AES256" -> null
                }
            }
        }

      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  + s3bucket_arn      = (known after apply)
  + s3bucket_name     = (known after apply)
  - sayhi_bucket_arn  = "arn:aws:s3:::testing-submodules-resources" -> null
  - sayhi_bucket_name = "testing-submodules-resources" -> null

```

</details>

*Pushed by: @saudelog, Action: `pull_request`*